"""
На вход подается словарь со списком вещей для похода в качестве ключа и их массой max_weight в качестве значения.

Определите какие вещи влезут в рюкзак backpack передав его максимальную грузоподъёмность.

Результат должен быть в виде словаря {предмет:вес} с вещами в рюкзаке и сохранен в переменную backpack.

Достаточно вернуть один допустимый вариант.
items = {
    "ключи": 0.3,
    "кошелек": 0.2,
    "телефон": 0.5,
    "зажигалка": 0.1
}
max_weight = 1.0
{'ключи': 0.3, 'кошелек': 0.2, 'зажигалка': 0.1}

"""
items = {
    "ключи": 0.3,
    "кошелек": 0.2,
    "телефон": 0.5,
    "зажигалка": 0.1
}
max_weight = 1.0

# items = {
#     "ноутбук": 2.0,
#     "книги": 1.5,
#     "зарядное устройство": 0.5,
#     "бутерброды": 0.3,
#     "вода": 1.0
# }
# max_weight = 5.0
#
# items = {
#     "лодка": 3.0,
#     "велосипед": 4.0,
#     "мангал": 2.0
# }
# max_weight = 1.0
#
# items = {
#     "спальник": 1.5,
#     "палатка": 3.2,
#     "термос": 0.6,
#     "карта": 0.1,
#     "фонарик": 0.3,
#     "котелок": 0.8,
#     "еда": 2.5,
#     "одежда": 1.7,
#     "обувь": 1.2,
#     "нож": 0.2
# }
# max_weight = 7
#
# items = {
#     "спальник": 2.0,
#     "палатка": 3.5,
#     "термос": 0.8,
#     "карта": 0.2,
#     "фонарик": 0.5,
#     "котелок": 1.0,
#     "еда": 3.0,
#     "одежда": 1.8,
#     "обувь": 1.0,
#     "нож": 0.3
# }
# max_weight = 10
items = {
    "спальник": 1.5,
    "палатка": 3.2,
    "термос": 0.6,
    "карта": 0.1,
    "фонарик": 0.3,
    "котелок": 0.8,
    "еда": 2.5,
    "одежда": 1.7,
    "обувь": 1.2,
    "нож": 0.2
}
max_weight = 1
# backpack = {}
# for k, v in items.items():
#     if float((sum(backpack.values()) + v)) <= float(max_weight):
#         backpack[k] = float(v)
#
# print(backpack)


backpack = {}
for k, v in items.items():
    if v <= max_weight:
        backpack[k] = v
        max_weight -= v

print(backpack)


















